# Python Intro - Final Exercise

In [110]:
import pyodbc
import pandas as pd
import numpy as np

In [111]:
import pyodbc 
conn = pyodbc.connect("DSN=college;"
                      "server=DESKTOP-F1Q7Q52\SQLEXPRESS;"
                      "Database=college;"
                      "Trusted_Connection=yes;")

In [112]:
cursor = conn.cursor()
cursor.execute('SELECT * FROM Departments')

for row in cursor:
    print('row = %r' % (row,))

row = (1, ' English ')
row = (2, ' Science ')
row = (3, ' Arts ')
row = (4, ' Sport ')

In [113]:
### Get the students table
df_st = pd.read_sql("SELECT * FROM Students;",conn) 
df_st.head()

   StudentId  FirstName     LastName Gender
0        162    Elmira      Holston       F
1        154    Sierra    Van Vorst       F
2         28     Mycah      Bingham       F
3         54      Alia        Jones       F
4         31    Chanda     Fillmore       F

In [114]:
### Get the students table
df_dp = pd.read_sql("SELECT * FROM Departments;",conn) 
df_dp.head()

   DepartmentId DepartmentName
0             1       English
1             2       Science
2             3          Arts
3             4         Sport

In [115]:
### Get the students table
df_te = pd.read_sql("SELECT * FROM Teachers;",conn) 
df_te.head()

   TeacherID     FirstName    LastName      Gender
0          1       Kaylea    Monzingo    F
1          2       Amanda     Dworkin    F
2          3       Jordyn       Baron    F
3          4    Katherine      Dibari    F
4          5      Heather     Metcalf    F

In [116]:
### Get the students table
df_cu = pd.read_sql("SELECT * FROM Courses;",conn) 
df_cu.head()

   CourseId            CourseName  DepartmentID  TeacherId
0         1    English Begginers              1         15
1         2     Advanced English              1         15
2         3   ProffesionalEnglish             1         15
3         4         Mathematics               2          2
4         5   Matematics Advanced             2         13

In [117]:
### Get the students table
df_cl = pd.read_sql("SELECT * FROM Classroom;",conn) 
df_cl.head()

   CourseId  StudentId  degree
0         1        202    92.0
1         1         12    81.0
2         1        232    82.0
3         1        123    62.0
4         1        274    73.0

# Questions
 
 
## Q1. Count the number of students on each department

In [118]:
df1 = pd.merge( df_cl  ,df_cu, left_on=['CourseId'], right_on = ['CourseId'])
df1.head()

   CourseId  StudentId  degree           CourseName  DepartmentID  TeacherId
0         1        202    92.0   English Begginers              1         15
1         1         12    81.0   English Begginers              1         15
2         1        232    82.0   English Begginers              1         15
3         1        123    62.0   English Begginers              1         15
4         1        274    73.0   English Begginers              1         15

In [119]:

df1.groupby('DepartmentID').agg({'StudentId':['count']})

             StudentId
                 count
DepartmentID
1                   94
2                  378
3                  186
4                   96

## Q2. How many students have each course of the English department and the total number of students in the department?

In [121]:
df2=pd.merge(df_cl,df_cu,left_on=['CourseId'], right_on = ['CourseId'])
df2.head()

   CourseId  StudentId  degree           CourseName  DepartmentID  TeacherId
0         1        202    92.0   English Begginers              1         15
1         1         12    81.0   English Begginers              1         15
2         1        232    82.0   English Begginers              1         15
3         1        123    62.0   English Begginers              1         15
4         1        274    73.0   English Begginers              1         15

## Q3. How many small (<22 students) and large (22+ students) classrooms are needed for the Science department?

In [46]:

df1['StudentIdcount'] = 'Small_lass'

df1.loc[(df1['StudentIdcount'] > 22 )] = 'Big_class'

df1['StudentIdcount']

TypeError: '>' not supported between instances of 'str' and 'int'

## Q4. A feminist student claims that there are more male than female in the College. Justify if the argument is correct

In [91]:
df_st.groupby('Gender').agg({'StudentId':['count']})

       StudentId
           count
Gender
 F           165
 M           115

## Q5. For which courses the percentage of male/female students is over 70%?

In [ ]:
data.head()

data['Female'] = 0
data['Male'] = 0


data.loc[data.StudentGender == 'F','Female'] = 1
data.loc[data.StudentGender == 'M','Male'] = 1

df = data.groupby('CourseName').agg({'Female':['mean']})
if (df[df > 0.7].dropna().shape[0] > 0 ):
    print("Courses with females more than 70%: \n", df[df > 0.7].dropna())

df = data.groupby('CourseName').agg({'Male':['mean']})
if (df[df > 0.7].dropna().shape[0] > 0 ):
    print("Courses with males more than 70%: \n", df[df > 0.7].dropna())

## Q6. For each department, how many students passed with a grades over 80?

## Q7. For each department, how many students passed with a grades under 60?

## Q8. Rate the teachers by their average student's grades (in descending order).

## Q9. Create a dataframe showing the courses, departments they are associated with, the teacher in each course, and the number of students enrolled in the course (for each course, department and teacher show the names).

## Q10. Create a dataframe showing the students, the number of courses they take, the average of the grades per class, and their overall average (for each student show the student name).